## Pandas Library - PART 1

Pandas is a Python library primarily used for data analysis and manipulation. It provides data structures like DataFrames and Series that allow for efficient handling of tabular and time-series data

1. What is Data Frames?
2. what is Data Series?
3. Different operations in Pandas.

In [8]:
## Import Pandas library

import pandas as pd
import numpy as np

What is DataFrame?<br>
A dataframe is a data structure constructed with rows and columns, similar to a database or Excel spreadsheet.

In [28]:
## Understanding DataFrames
## pd.DataFrame(data=None,index: 'Axes | None' = None,columns: 'Axes | None' = None,dtype: 'Dtype | None' = None,copy: 'bool | None' = None,) -> 'None'

df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['R1','R2','R3','R4','R5'], columns = ['C1','C2','C3','C4'])

In [30]:
df.head()

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [32]:
df.to_csv('Test1.csv')

Accessing the element<br>
Two ways to Access element 
1. .loc() - row index
2. .iloc() - index location

In [48]:
## .loc()

df.loc['R1']

C1    0
C2    1
C3    2
C4    3
Name: R1, dtype: int32

In [50]:
type(df.loc['R1'])

pandas.core.series.Series

What is Data Series?<br>
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.)

In [53]:
## iloc()

df.iloc[:,:]

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [57]:
df.iloc[0:2,0:2]

    C1  C2
R1   0   1
R2   4   5

In [59]:
## conert DataFrames into array
## use .values

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [61]:
type(df.iloc[:,1:].values)

numpy.ndarray

In [65]:
## to check null values in a dataframe

df.isnull().sum()

C1    0
C2    0
C3    0
C4    0
dtype: int64

In [73]:
df

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [75]:
## how many unique category we have in a column. count basically
df['C1'].value_counts()

C1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [79]:
## to check unique values
df['C1'].unique()

array([ 0,  4,  8, 12, 16])

In [83]:
## to get the column
df['C3']

R1     2
R2     6
R3    10
R4    14
R5    18
Name: C3, dtype: int32

In [85]:
type(df['C3'])

pandas.core.series.Series

In [93]:
## to get two columns
## need multiple column add it in a list

df[['C2','C3']]

    C2  C3
R1   1   2
R2   5   6
R3   9  10
R4  13  14
R5  17  18